The  DocumentSynchronizingWithCentralEventArgs  type exposes the following members.
 Properties
Name  |   Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from  RevitAPIEventArgs  .)
Comments
 User's comments for synchronization.
Document
 The document associated with the event.
 (Inherited from  RevitAPIPreDocEventArgs  .)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  RevitAPIEventArgs  .)
Location
 Full path of the central model which is to be synchronized.
Options
 User's options associated with the synchronization operation.
 See Also
  DocumentSynchronizingWithCentralEventArgs Class
  Autodesk.Revit.DB.Events Namespace